#pragma once

#include"Initdata.h"
class Chessboard
{
public:
	char alpha = '@';
	int Board[N][N] = { 0 };
	void printboard()
	{
		char alpha = '@';
		for (int i = -1; i < N; i++)
		{
			for (int j = -1; j < N; j++)
			{

				if (i == -1) printf("%3c", alpha++);
				else if (j == -1) printf("%3d", i + 1);
				else if (Board[i][j] == black) printf("%3c", '@');
				else if (Board[i][j] == white) printf("%3c", '0');
				else  printf("%3c", '-');
			}
			printf("\n");
		}
	}
	void resetboard()
	{
		for (int i = 0; i < N; i++)
		{
			for (int j = 0; j < N; j++)
			{
				this->Board[i][j] = 0;
			}
		}
	}
	int PosValue[15][15] =//棋盘位置分
	{
	 {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
	 {0,1,1,1,1,1,1,1,1,1,1,1,1,1,0},
	 {0,1,2,2,2,2,2,2,2,2,2,2,2,1,0},
	 {0,1,2,3,3,3,3,3,3,3,3,3,2,1,0},
	 {0,1,2,3,4,4,4,4,4,4,4,3,2,1,0},
	 {0,1,2,3,4,5,5,5,5,5,4,3,2,1,0},
	 {0,1,2,3,4,5,6,6,6,5,4,3,2,1,0},
	 {0,1,2,3,4,5,6,7,6,5,4,3,2,1,0},
	 {0,1,2,3,4,5,6,6,6,5,4,3,2,1,0},
	 {0,1,2,3,4,5,5,5,5,5,4,3,2,1,0},
	 {0,1,2,3,4,4,4,4,4,4,4,3,2,1,0},
	 {0,1,2,3,3,3,3,3,3,3,3,3,2,1,0},
	 {0,1,2,2,2,2,2,2,2,2,2,2,2,1,0},
	 {0,1,1,1,1,1,1,1,1,1,1,1,1,1,0},
	 {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
	};

	int PosScore[N][N] = { 0 };//记录棋子在棋盘的位置分
	//由于设计缺陷，在记录分值时我们暂时不考虑当前位置的棋子颜色，后期需要单独写出if判断
	//也可以 在实例化对象是将值直接赋值记录在 Point->score 中
};